# Tap into some repos.
tap "felixkratz/formulae"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"

# Install nerdfons with icons
cask "font-meslo-lg-nerd-font"
cask "sf-symbols"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"

# Install command line tools
brew "bat"
brew "btop"
brew "eza" #modern ls
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git"
brew "imagemagick"
brew "ripgrep"
brew "starship"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-autocomplete"
brew "vim"
brew "rust-analyzer" #required for my vim
brew "stow" #stow dotfiles
brew "yazi" #file explorer
brew "wallpaper" #change wallpapers from terminal
brew "shellcheck" #spell check my shell scripts
brew "zoxide" #faster cd kinda thing
brew "ffmpeg" #dependency for yazi
brew "sevenzip" #look at zipped files in yazi
brew "jq" #dependency for yazi
brew "poppler" #dependency for yazi
brew "ripgrep" #faster grep
brew "resvg" #dependency for yazi

# Install graphical apps
cask "aerospace"
cask "brave-browser"
cask "chatgpt"
cask "ghostty"
cask "google-chrome"
cask "obsidian"
cask "upscayl"
cask "figma"
# cask "figma-agent" #this is buggy, commented. if fonts dont work uncomment
cask "chatgpt"
cask "zoom"
cask "whatsapp"
cask "slack"
