# Tap into some repos.
tap "felixkratz/formulae"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"

# Install nerdfons with icons
cask "font-meslo-lg-nerd-font"
cask "sf-symbols"
cask "font-jetbrains-mono-nerd-font"

# Install command line tools
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# My additions, no explanation needed.
brew "zsh-autocomplete"
brew "vim"
brew "rust-analyzer"
brew "stow"
brew "yazi" #file explorer
brew "wallpaper" #change wallpapers from terminal
brew "shellcheck" #spell check my shell scripts

# Install graphical apps
cask "aerospace"
cask "brave-browser"
cask "chatgpt"
cask "ghostty"
cask "google-chrome"
cask "obsidian"
cask "upscayl"
cask "figma"
cask "figma-agent"
cask "chatgpt"
cask "zoom"
cask "whatsapp"
cask "slack"
